SET REFERENTIAL_INTEGRITY FALSE;

DELETE FROM seats;
DELETE FROM grades;
DELETE FROM performances;
DELETE FROM places;

-- 데이터 삽입 외래키 제약 조건 위반(Foreign Key Constraint Violation) 때문에 id 명시적 선언
INSERT INTO places (id, address, name, total_seats) VALUES
(1, '서울특별시 서초구 서초동 1307', '강남아트홀', 100),
(2, '서울특별시 마포구 와우산로21', '홍대소극장', 100),
(3, '서울시 종로구 대학로 8', '대학로극장', 100),
(4, '부산광역시 해운대구 중동2', '해운대문화회관', 100),
(5, '대구광역시 수성구 무학로 180', '수성아트센터', 100);

INSERT INTO grades (id, place_id, grade, seat_count, default_price) VALUES
-- 강남아트홀
(1, 1, 'S', 20, 120000),
(2, 1, 'A', 30, 90000),
(3, 1, 'B', 30, 60000),
(4, 1, 'C', 20, 40000),

-- 홍대소극장
(5, 2, 'S', 20, 100000),
(6, 2, 'A', 30, 80000),
(7, 2, 'B', 30, 50000),
(8, 2, 'C', 20, 30000),

-- 대학로극장
(9, 3, 'S', 20, 110000),
(10, 3, 'A', 30, 85000),
(11, 3, 'B', 30, 55000),
(12, 3, 'C', 20, 35000),

-- 해운대문화회관
(13, 4, 'S', 20, 115000),
(14, 4, 'A', 30, 88000),
(15, 4, 'B', 30, 58000),
(16, 4, 'C', 20, 38000),

-- 수성아트센터
(17, 5, 'S', 20, 118000),
(18, 5, 'A', 30, 89000),
(19, 5, 'B', 30, 59000),
(20, 5, 'C', 20, 39000);